#include <stdio.h>//这是上课讲的代码，重新打了一遍
/*
输入一个不多于6位的正整数，输出其逆序后的正整数。如：
输入：123456
输出：654321
输入示例：
输出示例：
*/
int main(){
    int n;
    scanf("%d",&n);
    if (n>=1000000){
        printf("error");
    }
    else if(n>=100000){
        printf("%d",n%10*100000+n/10%10*10000+n/100%10*1000+n/1000%10*100+n/10000%10*10+n/100000%10);
    }
    else if(n>=10000){
        printf("%d",n%10*10000+n/10%10*1000+n/100%10*100+n/1000%10*10+n/10000%10);
    }
    else if(n>=1000){
        printf("%d",n%10*1000+n/10%10*100+n/100%10*10+n/1000%10);
    }
    else if(n>=100){
        printf("%d",n%10*100+n/10%10*10+n/100%10);
    }
    else if(n>=10){
        printf("%d",n%10*10+n/10%10);
    }
    else {
        printf("%d",n);
    }
    return 0;
}